Repository: zwyyy456/zbox
Catalog: zbox/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Parameter Prompt
zh_hans: 参数提示

source: Parameterized URL
zh_hans: 带参数的网址

source: Quicklinks
zh_hans: 快捷入口

source: Quicklinks could not be read. The saved file has been preserved.
zh_hans: 无法读取快捷入口，已保留原有数据文件。

source: Search Quicklinks
zh_hans: 搜索快捷入口

source: Search value
zh_hans: 搜索内容

source: Target
zh_hans: 目标

source: The changes could not be saved. Check the storage location and try again.
zh_hans: 无法保存修改，请检查存储位置后重试。

source: The system could not open this quicklink. Check its address and installed app.
zh_hans: 系统无法打开此入口，请检查地址及对应应用是否已安装。

source: This file or folder no longer exists. Choose its new location in Settings.
zh_hans: 此文件或文件夹已不存在，请在设置中重新选择位置。

source: Type
zh_hans: 类型

source: URL
zh_hans: 网址

source: Use {query} in an HTTP(S) URL path or query value, not in its host, parameter name, or fragment.
zh_hans: 请将 {query} 放在 HTTP(S) 网址的路径或参数值中，不可放在域名、参数名或片段标识中。

source: Add Snippet
zh_hans: 添加文本片段

source: All Groups
zh_hans: 全部分组

source: Allow clipboard access in System Settings to use the clipboard variable.
zh_hans: 请在系统设置中允许访问剪贴板，再使用剪贴板变量。

source: Clipboard Text
zh_hans: 剪贴板文本

source: Date (yyyy-MM-dd)
zh_hans: 日期（yyyy-MM-dd）

source: Delete Snippet?
zh_hans: 删除此文本片段？

source: Enable Snippets
zh_hans: 启用文本片段

source: Enter a name and snippet text.
zh_hans: 请输入名称和片段正文。

source: Group
zh_hans: 分组

source: Group (optional)
zh_hans: 分组（可选）

source: Insert Variable
zh_hans: 插入变量

source: No snippets found.
zh_hans: 没有找到文本片段。

source: Return to paste • ⌘Return to copy • Esc to close
zh_hans: 回车粘贴 · ⌘回车复制 · Esc 关闭

source: Search Snippets
zh_hans: 搜索文本片段

source: Snippet Text
zh_hans: 片段正文

source: Snippets
zh_hans: 文本片段

source: Snippets could not be read. The saved file has been preserved.
zh_hans: 无法读取文本片段，已保留原有数据文件。

source: The clipboard changed. Execute the snippet again.
zh_hans: 剪贴板已变化，请重新执行片段。

source: The clipboard does not contain available plain text.
zh_hans: 剪贴板中没有可用的纯文本。

source: The clipboard is marked private or temporary and cannot be inserted into a snippet.
zh_hans: 剪贴板内容带有私密或临时标记，不能插入文本片段。

source: The clipboard text exceeds the 1 MiB limit.
zh_hans: 剪贴板文本超过 1 MiB 限制。

source: The snippet could not be copied. Try again.
zh_hans: 无法复制文本片段，请重试。

source: Time (HH:mm)
zh_hans: 时间（HH:mm）

source: Variables expand only when copied or pasted. Prefix {{ with a backslash to keep it literal.
zh_hans: 变量仅在复制或粘贴时展开。在 {{ 前加反斜杠可保留原文。

source: The original app is unavailable or has changed. Copy the item and paste it manually.
zh_hans: 原应用已不可用或前台应用已变化，请复制后手动粘贴。

source: Actions
zh_hans: 操作

source: Add Common Folder
zh_hans: 添加常用目录

source: Add Folder
zh_hans: 添加目录

source: All Search Folders
zh_hans: 全部搜索目录

source: All Types
zh_hans: 全部类型

source: Building index…
zh_hans: 正在建立索引…

source: Check the quotes and filters. Supported filters: ext:, type:file, type:folder, path:.
zh_hans: 请检查引号和筛选条件。支持 ext:、type:file、type:folder 和 path:。

source: Choose a folder on a local disk.
zh_hans: 请选择本地磁盘上的目录。

source: Choose a subfolder inside this search folder.
zh_hans: 请选择此搜索目录中的子目录。

source: Clear File Index
zh_hans: 清除文件索引

source: Clear File Index?
zh_hans: 清除文件索引？

source: Copy File
zh_hans: 复制文件

source: Copy Path
zh_hans: 复制路径

source: Desktop
zh_hans: 桌面

source: Documents
zh_hans: 文稿

source: Downloads
zh_hans: 下载

source: Enable File Search
zh_hans: 启用文件搜索

source: Enter a file name or choose a filter. Add search folders in Settings.
zh_hans: 输入文件名或选择筛选条件，可在设置中添加搜索目录。

source: Exclude Subfolder
zh_hans: 排除子目录

source: Extension
zh_hans: 扩展名

source: File Search
zh_hans: 文件搜索

source: File Search settings could not be read. Saved data has been preserved.
zh_hans: 无法读取文件搜索设置，已保留原有数据。

source: File changes could not be monitored. Check access and rescan.
zh_hans: 无法监听文件变化，请检查访问权限并重新扫描。

source: Files
zh_hans: 文件

source: Folders
zh_hans: 文件夹

source: Include Hidden Files
zh_hans: 包含隐藏文件

source: Index cleared. Enabled search folders will be rebuilt.
zh_hans: 索引已清除，已启用的搜索目录将重新建立索引。

source: Index ready
zh_hans: 索引已就绪

source: Index ready (initial scan: %lld items)
zh_hans: 索引已就绪（首次扫描 %lld 项）

source: Modified
zh_hans: 修改时间

source: Only selected folders are indexed. File contents are not read.
zh_hans: 仅索引选定目录，不读取文件正文。

source: Only the index is removed. Your files and search folders are kept. Enabled folders will be rebuilt.
zh_hans: 仅清除索引，保留文件和搜索目录配置。已启用的目录将重新建立索引。

source: Opening or previewing cloud files may download them.
zh_hans: 打开或预览云端文件时，系统可能下载文件。

source: Quick Look
zh_hans: 快速查看

source: Relevance
zh_hans: 相关性

source: Remove Exclusion
zh_hans: 取消排除

source: Remove Folder
zh_hans: 移除目录

source: Rescan
zh_hans: 重新扫描

source: Search Folder
zh_hans: 搜索目录

source: Search Folders
zh_hans: 搜索目录

source: Search file names — ext:pdf, type:folder, path:project
zh_hans: 搜索文件名 — ext:pdf、type:folder、path:project

source: Show in Finder
zh_hans: 在 Finder 中显示

source: Showing the best 200 matches. Narrow your search for more.
zh_hans: 显示前 200 条最佳结果，请缩小搜索范围。

source: Some folders could not be scanned. The index is incomplete; check access and rescan.
zh_hans: 部分目录无法扫描，索引尚不完整，请检查访问权限并重新扫描。

source: Sort
zh_hans: 排序

source: The file index could not be opened or saved.
zh_hans: 无法打开或保存文件索引。

source: The file operation could not be completed.
zh_hans: 无法完成文件操作。

source: The search folder is unavailable or its disk identity has changed.
zh_hans: 搜索目录不可用，或磁盘／目录身份已变化。

source: This folder overlaps an existing search folder.
zh_hans: 此目录与已有搜索目录重叠。

source: This item is no longer accessible. Its search folder will be refreshed.
zh_hans: 此项目已无法访问，将刷新对应搜索目录。

source: Updating index…
zh_hans: 正在更新索引…

source: %lld matches
zh_hans: %lld 条结果

source: Seconds
zh_hans: 秒

source: Milliseconds
zh_hans: 毫秒

source: Timestamp
zh_hans: 时间戳

source: Enter integer milliseconds or seconds with at most three decimal places.
zh_hans: 请输入整数毫秒，或最多三位小数的秒数。

source: The timestamp must fall within UTC years 0001–9999.
zh_hans: 时间戳必须在 UTC 公元 0001 至 9999 年范围内。

source: Enter a valid ISO 8601 date with a time zone, for example 2026-10-03T10:30:00.123+08:00.
zh_hans: 请输入带时区的有效 ISO 8601 日期，例如 2026-10-03T10:30:00.123+08:00。

source: Standard JSON · Formatting preserves numbers, key order, and string escapes.
zh_hans: 标准 JSON · 格式化保留数字原文、键顺序和字符串转义。

source: URL components · Spaces use %20; + stays a plus sign when decoding.
zh_hans: URL 组件 · 空格编码为 %20；解码时 + 保持加号。

source: UTF-8 text · Standard output is padded; URL-safe output omits padding.
zh_hans: UTF-8 文本 · 标准输出保留填充，URL-safe 输出省略填充。

source: Valid JSON syntax.
zh_hans: JSON 语法有效。

source: Run to update the result.
zh_hans: 执行操作以更新结果。

source: Operation
zh_hans: 操作

source: Indent
zh_hans: 缩进

source: Alphabet
zh_hans: 字母表

source: Run
zh_hans: 执行

source: 2 spaces
zh_hans: 2 个空格

source: 4 spaces
zh_hans: 4 个空格

source: Encode
zh_hans: 编码

source: Decode
zh_hans: 解码

source: Standard Base64
zh_hans: 标准 Base64

source: Input
zh_hans: 输入

source: Output
zh_hans: 输出

source: Go to Error
zh_hans: 定位错误

source: Use Result as Input
zh_hans: 将结果用作输入

source: Copy Result
zh_hans: 复制结果

source: UUID v4 · One UUID per line
zh_hans: UUID v4 · 每行一个 UUID

source: Copy All
zh_hans: 全部复制

source: Count: %lld
zh_hans: 数量：%lld

source: Uppercase
zh_hans: 大写

source: Generate
zh_hans: 生成

source: Input exceeds the 1 MiB limit.
zh_hans: 输入超过 1 MiB 限制。

source: Invalid percent encoding or UTF-8 text.
zh_hans: 百分号编码或 UTF-8 文本无效。

source: The decoded result is not UTF-8 text.
zh_hans: 解码结果不是 UTF-8 文本。

source: Invalid Base64 characters, length, or padding.
zh_hans: Base64 字符、长度或填充无效。

source: JSON Format / Validate
zh_hans: JSON 格式化与校验

source: Timestamp Converter
zh_hans: 时间戳转换

source: UUID Generator
zh_hans: UUID 生成

source: URL Encode / Decode
zh_hans: URL 编解码

source: Base64 Encode / Decode
zh_hans: Base64 编解码

source: Developer Tools
zh_hans: 开发者工具

source: Built-in Developer Tools
zh_hans: 内置开发者工具

source: Could not copy the result.
zh_hans: 无法复制结果。

source: Line %lld, column %lld: %@
zh_hans: 第 %lld 行，第 %lld 列：%@

source: Format JSON
zh_hans: 格式化

source: Compact
zh_hans: 压缩

source: Validate
zh_hans: 校验

source: Unexpected text after the JSON value.
zh_hans: JSON 值之后存在多余内容。

source: Expected ':' after the object key.
zh_hans: 对象键之后应为冒号。

source: Expected a quoted object key.
zh_hans: 对象键必须使用双引号。

source: JSON exceeds the 256-level nesting limit.
zh_hans: JSON 超过 256 层嵌套限制。

source: Expected a JSON value.
zh_hans: 此处应为 JSON 值。

source: Expected ',' or the closing bracket.
zh_hans: 此处应为逗号或结束括号。

source: Unescaped control character in a string.
zh_hans: 字符串中包含未转义的控制字符。

source: Expected four hexadecimal digits after '\u'.
zh_hans: \u 之后必须有四位十六进制数字。

source: Invalid string escape.
zh_hans: 字符串转义无效。

source: Unterminated string.
zh_hans: 字符串缺少结束双引号。

source: Formatted output exceeds the 8 MiB limit.
zh_hans: 格式化结果超过 8 MiB 限制。

source: Invalid JSON literal.
zh_hans: JSON 字面量无效。

source: Expected a digit in the number.
zh_hans: 数值中此处应为数字。

source: Include Z or an explicit offset such as +08:00. Precision: up to milliseconds.
zh_hans: 必须包含 Z 或 +08:00 等明确时区偏移，精度最多为毫秒。

source: Units are explicit. Negative timestamps are supported.
zh_hans: 请明确选择单位，支持负时间戳。

source: Timestamp Input
zh_hans: 时间戳输入

source: Local Time
zh_hans: 本地时间

source: Copy Result copies UTC for timestamp input, or seconds for date input.
zh_hans: 输入时间戳时复制 UTC 日期，输入日期时复制秒时间戳。

source: Direction
zh_hans: 转换方向

source: Input Unit
zh_hans: 输入单位

source: Timestamp to Date
zh_hans: 时间戳转日期

source: Date to Timestamp
zh_hans: 日期转时间戳

source: Current Time
zh_hans: 当前时间

source: Convert
zh_hans: 转换

source: Copy %@
zh_hans: 复制%@
